app/controllers/hardwares_controller.rb

  def index
    @hardwares = Hardware.all
---
SELECT "hardwares".* FROM "hardwares"

  def create
    @hardware = Hardware.new(hardware_params)

    respond_to do |format|
      if @hardware.save
---
INSERT INTO "hardwares" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "x86"], ["created_at", "2015-06-08 19:06:03.929809"], ["updated_at", "2015-06-08 19:06:03.929809"]]

  def update
    respond_to do |format|
      if @hardware.update(hardware_params)
---
UPDATE "hardwares" SET "name" = ?, "updated_at" = ? WHERE "hardwares"."id" = ?  [["name", "x86_64"], ["updated_at", "2015-06-08 19:06:09.609830"], ["id", 1]]

    def set_hardware
      @hardware = Hardware.find(params[:id])
---
SELECT  "hardwares".* FROM "hardwares" WHERE "hardwares"."id" = ? LIMIT 1  [["id", 1]]