app/controllers/osdefs_controller.rb

  def index
    @osdefs = Osdef.all
---
SELECT "osdefs".* FROM "osdefs"

  def create
    @osdef = Osdef.new(osdef_params)

    respond_to do |format|
      if @osdef.save
---
INSERT INTO "osdefs" ("name", "version", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Linux"], ["version", "2.6"], ["created_at", "2015-06-08 19:00:18.016244"], ["updated_at", "2015-06-08 19:00:18.016244"]]

    def set_osdef
      @osdef = Osdef.find(params[:id])
---
SELECT  "osdefs".* FROM "osdefs" WHERE "osdefs"."id" = ? LIMIT 1  [["id", 1]]