app/controllers/priorities_controller.rb

SELECT "priorities".* FROM "priorities"
---
  def index
    @priorities = Priority.all

INSERT INTO "priorities" ("name", "desc", "enum", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Critical"], ["desc", "Fix this NOW!"], ["enum", 100], ["created_at", "2015-06-08 19:04:25.476336"], ["updated_at", "2015-06-08 19:04:25.476336"]]
---
  def create
    @priority = Priority.new(priority_params)

    respond_to do |format|
      if @priority.save

SELECT  "priorities".* FROM "priorities" WHERE "priorities"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_priority
      @priority = Priority.find(params[:id])