app/controllers/ticket_updates_controller.rb

SELECT "ticket_updates".* FROM "ticket_updates"
---
  def index
    @ticket_updates = TicketUpdate.all

INSERT INTO "ticket_updates" ("title", "desc", "Ticket_id", "User_id", "AssignedUser_id", "State_id", "Priority_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @ticket_update = TicketUpdate.new(ticket_update_params)

    respond_to do |format|
      if @ticket_update.save

UPDATE "ticket_updates" SET "desc" = ?, "updated_at" = ? WHERE "ticket_updates"."id" = ?  [["desc", "Our ruby expert just has to learn ruby real quick"], ["updated_at", "2015-06-08 23:11:53.558197"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @ticket_update.update(ticket_update_params)

DELETE FROM "ticket_updates" WHERE "ticket_updates"."id" = ?  [["id", 1]]
---
  def destroy
    @ticket_update.destroy

SELECT  "ticket_updates".* FROM "ticket_updates" WHERE "ticket_updates"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_ticket_update
      @ticket_update = TicketUpdate.find(params[:id])