app/controllers/ticket_categories_controller.rb

SELECT "ticket_categories".* FROM "ticket_categories"
---
  def index
    @ticket_categories = TicketCategory.all

INSERT INTO "ticket_categories" ("name", "desc", "User_id", "TicketGroup_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @ticket_category = TicketCategory.new(ticket_category_params)

    respond_to do |format|
      if @ticket_category.save

SELECT  "ticket_categories".* FROM "ticket_categories" WHERE "ticket_categories"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_ticket_category
      @ticket_category = TicketCategory.find(params[:id])