app/controllers/tickets_controller.rb

  def index
    @tickets = Ticket.all
---
SELECT "tickets".* FROM "tickets"

  def create
    @ticket = Ticket.new(ticket_params)

    respond_to do |format|
      if @ticket.save
---
INSERT INTO "tickets" ("title", "desc", "reproSteps", "User_id", "AssignedUser_id", "Priority_id", "State_id", "osdef_id", "Hardware_id", "TicketCategory_id", "TicketGroup_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @ticket.update(ticket_params)
---
UPDATE "tickets" SET "Priority_id" = ?, "State_id" = ?, "osdef_id" = ?, "Hardware_id" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["Priority_id", 1], ["State_id", 1], ["osdef_id", 1], ["Hardware_id", 1], ["updated_at", "2015-06-08 19:57:02.933293"], ["id", 4]]

    def set_ticket
      @ticket = Ticket.find(params[:id])
---
SELECT  "tickets".* FROM "tickets" WHERE "tickets"."id" = ? LIMIT 1  [["id", 4]]