app/controllers/ticket_groups_controller.rb

  def index
    @ticket_groups = TicketGroup.all
---
SELECT "ticket_groups".* FROM "ticket_groups"

  def create
    @ticket_group = TicketGroup.new(ticket_group_params)

    respond_to do |format|
      if @ticket_group.save
---
INSERT INTO "ticket_groups" ("name", "desc", "User_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Default Group"], ["desc", "The default group"], ["User_id", 1], ["created_at", "2015-06-08 19:06:55.216919"], ["updated_at", "2015-06-08 19:06:55.216919"]]

    def set_ticket_group
      @ticket_group = TicketGroup.find(params[:id])
---
SELECT  "ticket_groups".* FROM "ticket_groups" WHERE "ticket_groups"."id" = ? LIMIT 1  [["id", 1]]